Revit 2027 API
BuiltInFailures.GeometryFailures.CurveProjectTooShort Property
 The projection of the line in this view is too short to create a new Line
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveProjectTooShort { get; }
Public Shared ReadOnly Property CurveProjectTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveProjectTooShort {
	FailureDefinitionId^ get ();
}
static member CurveProjectTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace